Revit 2026 API

# AreaBasedLoadDataCanConnectToUpstreamNode Method

---

Verifies that the area based load can connect to the upstream electrical analytical node. If the area based load already has an upstream node or the upstream node is full of downstream nodes, the area based load can't connect to the upstream node.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanConnectToUpstreamNode(
	ElementId upstreamNodeId
)
```
```vb
Public Function CanConnectToUpstreamNode (
	upstreamNodeId As ElementId
) As Boolean
```
```cpp
public:
bool CanConnectToUpstreamNode(
	ElementId^ upstreamNodeId
)
```
```fsharp
member CanConnectToUpstreamNode :
        upstreamNodeId : ElementId -> bool
```

#### Parameters

upstreamNodeId ElementId
     The upstream electrical analytical node id.

#### Return Value

Boolean True if the area based load can connect to the upstream electrical analytical node.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.

#### Reference

AreaBasedLoadData Class

Autodesk.Revit.DB.Electrical Namespace